In [119]:
import pandas as pd
import numpy as np

df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [120]:
df = df.drop(["PassengerId","Name","Ticket","Fare","Cabin","Embarked"],axis = "columns")
df

     Pclass     Sex   Age  SibSp  Parch  Survived
0         3    male  22.0      1      0         0
1         1  female  38.0      1      0         1
2         3  female  26.0      0      0         1
3         1  female  35.0      1      0         1
4         3    male  35.0      0      0         0
..      ...     ...   ...    ...    ...       ...
886       2    male  27.0      0      0         0
887       1  female  19.0      0      0         1
888       3  female   NaN      1      2         0
889       1    male  26.0      0      0         1
890       3    male  32.0      0      0         0

[891 rows x 6 columns]

In [121]:
dummies= pd.get_dummies(df.Sex)
dummies

     female   male
0     False   True
1      True  False
2      True  False
3      True  False
4     False   True
..      ...    ...
886   False   True
887    True  False
888    True  False
889   False   True
890   False   True

[891 rows x 2 columns]

In [122]:
inputs = df.drop(["Sex","Survived"],axis = "columns")
target = df["Survived"]

In [123]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs

     Pclass   Age  SibSp  Parch  female   male
0         3  22.0      1      0   False   True
1         1  38.0      1      0    True  False
2         3  26.0      0      0    True  False
3         1  35.0      1      0    True  False
4         3  35.0      0      0   False   True
..      ...   ...    ...    ...     ...    ...
886       2  27.0      0      0   False   True
887       1  19.0      0      0    True  False
888       3   NaN      1      2    True  False
889       1  26.0      0      0   False   True
890       3  32.0      0      0   False   True

[891 rows x 6 columns]

In [124]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [125]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age  SibSp  Parch  female   male
0       3  22.000000      1      0   False   True
1       1  38.000000      1      0    True  False
2       3  26.000000      0      0    True  False
3       1  35.000000      1      0    True  False
4       3  35.000000      0      0   False   True
5       3  29.699118      0      0   False   True
6       1  54.000000      0      0   False   True
7       3   2.000000      3      1   False   True
8       3  27.000000      0      2    True  False
9       2  14.000000      1      0    True  False

In [126]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [127]:
len(X_train)

712

In [128]:
len(X_test)

179

In [129]:
print(X_train.dtypes)

Pclass      int64
Age       float64
SibSp       int64
Parch       int64
female       bool
male         bool
dtype: object

In [130]:
print(y_train.dtypes)

int64

In [131]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)
y_predict = model.predict(X_test)

In [132]:
model.score(X_test,y_test)

0.8212290502793296

In [133]:
X_test[:10]

     Pclass   Age  SibSp  Parch  female   male
884       3  25.0      0      0   False   True
27        1  19.0      3      2   False   True
188       3  40.0      1      1   False   True
290       1  26.0      0      0    True  False
588       3  22.0      0      0   False   True
872       1  33.0      0      0   False   True
332       1  38.0      0      1   False   True
654       3  18.0      0      0    True  False
433       3  17.0      0      0   False   True
147       3   9.0      2      2    True  False

In [134]:
y_test[:10]

884    0
27     0
188    0
290    1
588    0
872    0
332    0
654    0
433    0
147    0
Name: Survived, dtype: int64

In [135]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 0, 0, 0, 1, 0, 1])

In [136]:
model.predict_proba(X_test[:10])

array([[0.9658359 , 0.0341641 ],
       [0.99210506, 0.00789494],
       [0.96500124, 0.03499876],
       [0.0024547 , 0.9975453 ],
       [0.96381937, 0.03618063],
       [0.74212938, 0.25787062],
       [0.70350261, 0.29649739],
       [0.0216764 , 0.9783236 ],
       [0.95899599, 0.04100401],
       [0.05440798, 0.94559202]])